//=============================================================================
//
// 敵の処理 [enemytype2.h]
// Author : AYANO KUDO
//
//=============================================================================
#ifndef _ENEMYTYPE2_H_
#define _ENEMYTYPE2_H_
#include "main.h"
#include "enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CEnemytype2 : public CEnemy
{
public:
    CEnemytype2();
    ~CEnemytype2();

    CEnemytype2* Create(D3DXVECTOR3 pos);

    HRESULT Init(void);
    void Uninit(void);
    void Update(void);
    void Draw(void);
};
#endif // _ENEMYTYPE2_H_