//=============================================================================
//
// メイン処理 [main.h]
// Author : AYANO KUDO
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <WinSock2.h>
#include <Windows.h>
#include "d3dx9.h"
#define DIRECTINPUT_VERSION (0x0800)    // 警告対処用'dinput.h'の直前に定義
#include "dinput.h"
#include <xaudio2.h>                    // サウンド関係の処理

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")
#pragma comment(lib, "dxguid.lib")
#pragma comment(lib, "winmm.lib")       //システム時刻取得用に必要
#pragma comment(lib, "dinput8.lib")     // 入力処理に必要
#pragma comment(lib,"ws2_32.lib")       // Winsockのライブラリ

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	WINDOW_POS_X	(0)     // ウィンドウの位置(x軸)
#define	WINDOW_POS_Y	(0)     // ウィンドウの位置(y軸)
#define SCREEN_WIDTH	(1280)  // ウィンドウサイズ(x軸)
#define SCREEN_HEIGHT	(720)   // ウィンドウサイズ(y軸)

#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)
#define NUM_VERTEX      (4)     //頂点数
#define NUM_POLYGON     (2)     //ポリゴン数

#define MAX_POLYGON (1024)                     // ポリゴンの最大数

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);

//*****************************************************************************
// 構造体定義
//*****************************************************************************
// 頂点情報の構造体
typedef struct
{
    D3DXVECTOR3 pos;        // 頂点座標
    float       rhw;        // 座標変換用係数  (1.0で固定)
    D3DCOLOR    col;        // 頂点カラー
    D3DXVECTOR2 tex;        // テクスチャ座標
}VERTEX_2D;

// テクスチャ情報の構造体
typedef struct
{
    D3DXVECTOR3 pos;        // 位置
    D3DXVECTOR3 size;       // サイズ
    char       *textureName; // テクスチャファイル名

}TEXTURE_DATA;
#endif